"""Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) —
на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый,
зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и
завершать скрипт."""

import time


class TrafficLight:
    __color = ['red', 'yellow', 'green']

    def running(self):
        i = 0
        while i <= 3:
            if i == 1:
                print("Цвет светофора - red")
                time.sleep(7)
            elif i == 2:
                print("Цвет светофора - yellow")
                time.sleep(2)
            elif i == 3:
                print("Цвет светофора - green")
                time.sleep(25)
            i+=1


TrafficLight = TrafficLight()
TrafficLight.running()